---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentDistance
source: html/d1d20cc1-7233-4f45-5e9c-bc84762e6df0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentDistance Property

"End Attachment Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamEndAttachmentDistance { get; }
```